NCE2/L61 Trouble with the Hubble.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-06 Tue 22:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-orgdd904ac" class="outline-2">
<h2 id="orgdd904ac">Lesson 61 Trouble with the Hubble</h2>
<div class="outline-text-2" id="text-orgdd904ac">
<p class="verse">
What is the special importance of a telescope in space?<br />
<br />
The Hubble telescope was launched into space by NASA on April 20, 1990<br />
&#xa0;at a cost of over a billion dollars.<br />
<b>Right from the start</b> there was trouble with the Hubble.<br />
The pictures it sent us were very disappointing<br />
&#xa0;because its main mirror was faulty.<br />
NASA is now going to put the telescope right,<br />
&#xa0;so it will soon be sending up four astronauts to repair it.<br />
The shuttle Endeavour will be taking the astronauts to the Hubble.<br />
A robot-arm from the Endeavour will grab the telescope<br />
&#xa0;and hold it while the astronauts make the necessary repairs.<br />
Of course, the Hubble is above the earth's atmosphere,<br />
&#xa0;so it will soon be sending us the clearest pictures of the stars<br />
&#xa0;&#xa0;and distant galaxies that we have ever seen.<br />
The Hubble will tell us a great deal about the age and size of the universe.<br />
By the time you read this,<br />
&#xa0;the Hubble's eagle eye will have sent us thousands and thousands of wonderful pictures.<br />
</p>
</div>
<div id="outline-container-orgb6d88c6" class="outline-3">
<h3 id="orgb6d88c6">expression</h3>
<div class="outline-text-3" id="text-orgb6d88c6">
<p>
Hubble [hʌb(ə)l] n.哈勃<br />
telescope [ˈteləˌskoʊp] n.望远镜<br />
launch [lɔntʃ] v.发射<br />
space [speɪs] n.空间<br />
NASA [ˈnæsə] n. National Aeronautics and Space Administration<br />
billion [ˈbɪljən] n.10亿<br />
faulty [ˈfɔlti] adj.有错误的<br />
astronaut [ˈæstrənɔːt] n.宇航员<br />
shuttle [ˈʃʌt(ə)l] n.航天飞机<br />
Endeavour [ɪn'devər] n."奋进"号<br />
robot-arm [ˈroʊˌbɑt] [ɑrm] n.机器手<br />
grab [ɡræb] v.抓<br />
atmosphere [ˈætməˌsfɪr] n.大气层<br />
distant [ˈdɪstənt] adj.遥远的<br />
galaxy [ˈɡæləksi] n.星系<br />
universe [ˈjunɪvərs] n.宇宙<br />
eagle [ˈɪɡ(ə)l] eye 鹰眼<br />
</p>

<p>
grab a beer/coffee 喝杯啤酒/咖啡<br />
</p>

<hr />
<p>
will be doing<br />
will have done<br />
will have been doing: 动作持续(重复)到将来 ?<br />
</p>

<p>
right from the start 从一开始<br />
</p>
</div>
</div>



<div id="outline-container-org3d5e76e" class="outline-3">
<h3 id="org3d5e76e">单词造句</h3>
</div>
<div id="outline-container-orgb17f045" class="outline-3">
<h3 id="orgb17f045">反复听电影片段</h3>
</div>
<div id="outline-container-orgb3d0795" class="outline-3">
<h3 id="orgb3d0795">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-org841a061" class="outline-3">
<h3 id="org841a061">给自己讲解</h3>
</div>
<div id="outline-container-org0067710" class="outline-3">
<h3 id="org0067710">红皮书</h3>
</div>
<div id="outline-container-org8fa8846" class="outline-3">
<h3 id="org8fa8846">习惯用法造句</h3>
</div>
<div id="outline-container-org3f8a2fc" class="outline-3">
<h3 id="org3f8a2fc">跟读至背诵</h3>
</div>
<div id="outline-container-org3896ad5" class="outline-3">
<h3 id="org3896ad5">Ask me if 写+读</h3>
</div>
<div id="outline-container-org9e9c4d4" class="outline-3">
<h3 id="org9e9c4d4">摘要写作</h3>
</div>
<div id="outline-container-org9f82d8f" class="outline-3">
<h3 id="org9f82d8f">tell the story 口语</h3>
</div>
<div id="outline-container-org1cedcae" class="outline-3">
<h3 id="org1cedcae">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
